# Brewfile — install everything with `brew bundle`
# True this up against the current machine with: brew bundle dump --force --describe

# ---------------------------------------------------------------------------
# CLI tools
# ---------------------------------------------------------------------------
brew "bash"
brew "zsh"
brew "git"
brew "git-delta"          # nicer git diffs
brew "git-filter-repo"
brew "gh"                 # GitHub CLI
brew "wget"
brew "ripgrep"            # rg — the `f` alias depends on this
brew "mcfly"              # smarter shell history search
brew "gnupg"
brew "mackup"             # app-settings backup/restore
brew "nvm"                # node versions (node itself installed via `nvm install --lts`)
brew "uv"                 # python packaging
brew "awscli"
brew "doppler"            # secrets management
brew "vercel-cli"
brew "docker"             # docker CLI (the Desktop app is a cask below)
brew "kubernetes-cli"
brew "helm"
brew "k9s"                # kubernetes TUI
brew "redis"
brew "trivy"              # container/security scanner
brew "zizmor"             # GitHub Actions security auditor
brew "pinact"             # pin GitHub Actions versions
brew "agent-browser"

# ---------------------------------------------------------------------------
# Apps
# ---------------------------------------------------------------------------

# Essentials
cask "1password"
cask "iterm2"
cask "rectangle"          # window management (replaced SizeUp)
cask "caffeine"
cask "daisydisk"
cask "numi"

# Browsers
cask "google-chrome"

# Dev
cask "visual-studio-code"
cask "cursor"
cask "postman"
cask "tableplus"
cask "postgres-unofficial"  # Postgres.app

# AI
cask "claude"
cask "claude-code"
cask "chatgpt"
cask "codex"

# Communication & work
cask "slack"
cask "zoom"
cask "whatsapp"
cask "linear-linear"      # Linear
cask "figma"
cask "wispr-flow"         # voice dictation

# Cloud storage & sync
cask "dropbox"
cask "google-drive"
cask "onedrive"
cask "tailscale-app"

# Media & misc
cask "spotify"
cask "vlc"
cask "transmission"
cask "steam"
cask "keybase"
cask "foks"

# ---------------------------------------------------------------------------
# Fonts
# ---------------------------------------------------------------------------
cask "font-monaspace"     # Monaspace Neon — VS Code editor font

# ---------------------------------------------------------------------------
# VS Code extensions
# ---------------------------------------------------------------------------
vscode "anthropic.claude-code"
vscode "dbaeumer.vscode-eslint"
vscode "esbenp.prettier-vscode"
vscode "golang.go"
vscode "hashicorp.terraform"
